# SQL Part 1

## Import pandas and MySQLdb

In [1]:
from sqlalchemy import create_engine
import pandas as pd

## Create the connection to MySQL database

- Define the connection to mysql database (mysql://user:passod@host/databse). More detail: http://zetcode.com/db/sqlalchemy/

In [2]:
eng = create_engine("mysql://root:spr18@localhost/PHC7065")
con = eng.connect()

## SELECT and FROM

In [3]:
sqlq = 'SELECT * FROM TESTTBL;'

In [4]:
#run the sql query and save the results to a pandas dataframe "dat"
dat = pd.read_sql(sql=sqlq,con=con)

In [5]:
dat

   id    title    author        date
0   1  title 1  author 1  2017-01-21
1   2  title 2  author 2  2017-02-21
2   3  title 4  author 4        None
3   4  title 5  author 5        None
4   5  title 6  author 6        None
5   6  title 7  author 7        None

## LIMIT

In [6]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        LIMIT 2
        ;"""

In [7]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author        date
0   1  title 1  author 1  2017-01-21
1   2  title 2  author 2  2017-02-21

## WHERE

In [8]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE date IS NOT NULL
        ;"""

In [9]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author        date
0   1  title 1  author 1  2017-01-21
1   2  title 2  author 2  2017-02-21

## LIKE

In [10]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE author LIKE '_uthor 5'
        ;"""

In [11]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author  date
0   4  title 5  author 5  None

## IN

In [12]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE id IN (1,2,3)
        ;"""

In [13]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author        date
0   1  title 1  author 1  2017-01-21
1   2  title 2  author 2  2017-02-21
2   3  title 4  author 4        None

## BETWEEN

In [14]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE date BETWEEN "2017-01-01" AND "2017-02-01" 
        ;"""

In [15]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author        date
0   1  title 1  author 1  2017-01-21

## AND

In [16]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE date IS NULL AND id > 5 
        ;"""

In [17]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author  date
0   6  title 7  author 7  None

## OR

In [18]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE date IS NULL OR id > 5 
        ;"""

In [19]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author  date
0   3  title 4  author 4  None
1   4  title 5  author 5  None
2   5  title 6  author 6  None
3   6  title 7  author 7  None

## ORDER BY

In [20]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        ORDER BY date DESC 
        ;"""

In [21]:
pd.read_sql(sql=sqlq,con=con)

   id    title    author        date
0   2  title 2  author 2  2017-02-21
1   1  title 1  author 1  2017-01-21
2   3  title 4  author 4        None
3   4  title 5  author 5        None
4   5  title 6  author 6        None
5   6  title 7  author 7        None

## Export pandas dataframe to MySQL

In [22]:
sqlq = """
        SELECT * 
        FROM TESTTBL
        WHERE date IS NOT NULL
        ORDER BY date DESC 
        ;"""

In [23]:
dat = pd.read_sql(sql=sqlq,con=con)

In [24]:
dat.to_sql(name='TESTTBL2',con=con,schema=None,if_exists='replace',index=True,index_label=None,chunksize=None,dtype=None)

In [25]:
dat

   id    title    author        date
0   2  title 2  author 2  2017-02-21
1   1  title 1  author 1  2017-01-21